
# * โปรแกรมแสดงการหาพื้นที่สี่เหลี่ยมผืนผ้าโดยเรียกใช้งานฟังก์ชัน

def rectangle_area(width, height):
    return width * height

# * หาค่าพื้นที่สีเหลี่ยมผืนผ้าโดยนำค่าความกว้าง
# * และความยาวมาคูณกันและใช้คำสั่ง return
# * ส่งคืนค่าพื้นที่กลับออกไปจากฟังก์ขัน


w = int(input("ความกว้าง :"))
h = int(input("ความยาว :"))

area = rectangle_area(w, h)

# * เนื่องจากมีการคืนค่าพื้นที่กลับออกมาจากฟักก์ชัน
# * ดังนั้น จึงนำตัวแปร area มารับค่าที่ฟังก์ชัน
# * คืนกลับออกมา

print("พื้นที่สี่เหลี่ยมผืนผ่า คือ", area)
