
# * Keyword arguments
# * โปรแกรมแสดงการส่งข้อมูลไปยังฟังก์ชันแบบไม่เรียงลำดับพารามิเตอร์

def address(road, district, province):
    print(" บ้านของฉันอยู่ที่ ถนน " + road +
          " ตำบล " + district + " จังหวัด " + province)


address(province=" กรุงเทพมหานคร ", road=" รามอินทราน", district=" ก.ม 8 ")
# * นี้คือการส่งข้อมูลไปยังฟังก์ชัน แบบไม่เรียงตามลำดับพารามิเตอร์
# * ซึ่งทำได้โดยระบุชื่อตัวแปรพารามิเตอร์ = ค่าข้อมูล


address(" ตำหรุ-บางพลี ", " แพรกษาใหม่ ", " สมุทรปราการ ")
# * นี้คือการส่งข้อมูลไปยังฟังก์ชัน ในรูปแบบปกติ คือ การส่งเรียงตามลำดับพารามิเตอร์
